Revit 2027 API
TableSectionData.FirstRowNumber Property
 The first row in this section of the table.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int FirstRowNumber { get; }
Public ReadOnly Property FirstRowNumber As Integer
	Get
public:
property int FirstRowNumber {
	int get ();
}
member FirstRowNumber : int with get
Property Value
Int32
Remarks
 Some table sections have row 0 as their first row while others start with row 1.
See Also
Reference
TableSectionData Class
Autodesk.Revit.DB Namespace